Revit 2024 API
MechanicalUtils.ConvertDuctPlaceholders Method
 Converts a collection of duct placeholder elements into duct elements.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static ICollection<ElementId> ConvertDuctPlaceholders(
	Document document,
	ICollection<ElementId> placeholderIds
)
Visual Basic
Public Shared Function ConvertDuctPlaceholders ( _
	document As Document, _
	placeholderIds As ICollection(Of ElementId) _
) As ICollection(Of ElementId)
Visual C++
public:
static ICollection<ElementId^>^ ConvertDuctPlaceholders(
	Document^ document,
	ICollection<ElementId^>^ placeholderIds
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
placeholderIds
Type: System.Collections.Generic.ICollection<ElementId>
 A collection of element IDs of duct placeholders.
Return Value
 A collection of element IDs of ducts and fittings.
Remarks
 Once conversion succeeds, the duct placeholder elements are deleted. The new duct and fitting elements are created and connections are established.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given element id set is empty. -or- The given element IDs (placeholderIds) are not duct placeholders. -or- The elements belong to different types of system.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MechanicalUtils Class
Autodesk.Revit.DB.Mechanical Namespace